#+TITLE:     Quilt Design and Psuedocode
#+AUTHOR:    George Jones
#+EMAIL:     gmj@cert.org
#+DATE:      2013-03-20 Wed
#+DESCRIPTION:

This is a coding exercise to flesh out issues in Quilt design.  
These examples ignore issues of scale and distribution.

*** sourceQuery Example
#+name: sourceQueryExample
#+HEADER: :results output
#+HEADER: :exports both    
#+BEGIN_SRC python
import pprint
import time
pp = pprint.PrettyPrinter(indent=4)
now="%f" % (time.time())

# registeredSourceQueries are passed up to the queryMaster from the sourceMasters.
# This is defiend here for the sake of example.  In operation, all we would have
# here is list of registeredQueries with this (and others) already defined.

registeredQueryID={}
registeredQueryID["queryName"]="allOutboundTraffic"
registeredQueryID["queryRequiredParameters"]={'STARTDATE': None}
registeredQueryID["queryOptionalParameters"]={}
registeredQueryID["eventFieldSpec"]=["sIP","dIP","sPort","dPort","pro","packets","bytes","flags","sTime","dur","eTime","sen"]
registeredQueryID["queryString"] = "rwfilter --type=out,outweb --proto=0- --start-date=STARTDATE --pass=stdout"
registeredQueryID["registeredMaster"]="mySiLKRepo"
print "registeredQueryID="
pp.pprint(registeredQueryID)

# this is where queryMaster code begins.

registeredSourceQueries = {}
registeredSourceQueries[registeredQueryID["queryName"]] = registeredQueryID  # callbacks from sourceMaster

# choose a query to issue

sourceQuery=registeredSourceQueries["allOutboundTraffic"].copy()

# modify parameters, etc.

sourceQuery["queryRequiredParameters"]["STARTDATE"]='2013/03/20:11'
sourceQuery["eventFieldSpec"] = sourceQuery["eventFieldSpec"][0:4]
sourceQuery["sourceQueryID"] = None

# generate unique sourceQueryID

sourceQueryID={}
sourceQueryID["time"]=now
sourceQueryID["queryName"]=sourceQuery["queryName"]
sourceQueryID["queryRequiredParameters"]=sourceQuery["queryRequiredParameters"]
sourceQueryID["queryOptionalParameters"]=sourceQuery["queryOptionalParameters"]
print "sourceQueryID="
pp.pprint(sourceQueryID)

# Add ID to the query to allow sourceMaster to cache, re-query, etc.
# Implementation-wise this may be redundant since all the info but
# the timestamp is in the query, but is included here for clarity.


sourceQuery["sourceQueryID"] = sourceQueryID.copy()
print "sourceQuery="
pp.pprint(sourceQuery)

# Issue the query...

# Get results...

events = []
events.append(['1363184654.264842', '1.1.1.1|2.2.2.2|80']);
events.append(['1363184654.264842', '1.1.1.1|2.2.2.2|80']); # duplicate event
events.append(['1363184664.000000', '1.1.1.1|2.2.2.2|80']); # repeate 10 seconds later
events.append(['1363184674.000000', '3.3.3.3|2.2.2.2|80']); # new source, 10 seconds later
events.append(['1363184674.000000', '3.3.3.3|2.2.2.2|53']); # different app, same time

# Pack the results into an event index table
eventIndexTable = {}
eventIndexTable["sourceQueryID"] = sourceQueryID;
eventIndexTable["table"] = events;

print "eventIndexTable="
pp.pprint(eventIndexTable)

#+END_SRC   

#+RESULTS: sourceQueryExample
#+begin_example
registeredQueryID=
{   'eventFieldSpec': [   'sIP',
                          'dIP',
                          'sPort',
                          'dPort',
                          'pro',
                          'packets',
                          'bytes',
                          'flags',
                          'sTime',
                          'dur',
                          'eTime',
                          'sen'],
    'queryName': 'allOutboundTraffic',
    'queryOptionalParameters': {   },
    'queryRequiredParameters': {   'STARTDATE': None},
    'queryString': 'rwfilter --type=out,outweb --proto=0- --start-date=STARTDATE --pass=stdout',
    'registeredMaster': 'mySiLKRepo'}
sourceQueryID=
{   'queryName': 'allOutboundTraffic',
    'queryOptionalParameters': {   },
    'queryRequiredParameters': {   'STARTDATE': '2013/03/20:11'},
    'time': '1364127771.391883'}
sourceQuery=
{   'eventFieldSpec': ['sIP', 'dIP', 'sPort', 'dPort'],
    'queryName': 'allOutboundTraffic',
    'queryOptionalParameters': {   },
    'queryRequiredParameters': {   'STARTDATE': '2013/03/20:11'},
    'queryString': 'rwfilter --type=out,outweb --proto=0- --start-date=STARTDATE --pass=stdout',
    'registeredMaster': 'mySiLKRepo',
    'sourceQueryID': {   'queryName': 'allOutboundTraffic',
                         'queryOptionalParameters': {   },
                         'queryRequiredParameters': {   'STARTDATE': '2013/03/20:11'},
                         'time': '1364127771.391883'}}
eventIndexTable=
{   'sourceQueryID': {   'queryName': 'allOutboundTraffic',
                         'queryOptionalParameters': {   },
                         'queryRequiredParameters': {   'STARTDATE': '2013/03/20:11'},
                         'time': '1364127771.391883'},
    'table': [   ['1363184654.264842', '1.1.1.1|2.2.2.2|80'],
                 ['1363184654.264842', '1.1.1.1|2.2.2.2|80'],
                 ['1363184664.000000', '1.1.1.1|2.2.2.2|80'],
                 ['1363184674.000000', '3.3.3.3|2.2.2.2|80'],
                 ['1363184674.000000', '3.3.3.3|2.2.2.2|53']]}
#+end_example

*** sourceEvent example

This example was ment to generate a few events, which it does below.  It
would up being a bunch of code to wrap rwfilter and rwcut. 

#+name: eventExample
#+HEADER: :results output
#+HEADER: :exports both    
#+BEGIN_SRC python
import subprocess
import StringIO

# case of specs must match case of rw* headers.
# this whole example wants to be PySiLK

eventTimeSpec = "sTime"			# which ouput field will have time?
eventFieldSpec = ["sIP","dIP"]		# which fields make up the event?
eventQuerySpec = [eventTimeSpec] + eventFieldSpec

# The use of subprocess and StringIO is a hack.
# The point is that we run a silk command and can
# parse lines later on to build up lists of events.
#

rwcutFields=",".join(eventQuerySpec)
cmd = "rwfilter --type=out,outweb --proto=0- --start-date=2013/03/20 -daddr=8.8.8.8 --pass=stdout | rwcut --fields=" + rwcutFields
cmdOut = subprocess.check_output(cmd, shell=True)
buf = StringIO.StringIO(cmdOut)

#
# parse out standard SiLK style text output:
#
#            sIP|            dIP|sPort|dPort|pro|   packets|     bytes|   flags|                  sTime|      dur|                  eTime|sen|
#   192.168.1.13|    224.0.0.251| 5353| 5353| 17|         2|       200|        |2013/03/13T17:14:34.251|    0.101|2013/03/13T17:14:34.352| S0|
#   192.168.1.42|  67.18.187.111|  123|  123| 17|         1|        76|        |2013/03/13T17:15:52.916|    0.048|2013/03/13T17:15:52.964| S0|
#   192.168.1.42|  134.121.64.62|  123|  123| 17|         1|        76|        |2013/03/13T17:16:52.916|    0.096|2013/03/13T17:16:53.012| S0|

linenum = 1
for line in buf.readlines():
    line=line.strip()
    line = line.rstrip("|")
    words = line.split("|")

    # assume first line is headers
    record = {}

    if linenum == 1:
      headers = []
      for word in words:
         word = word.strip()
         headers.append(word)
    else:
      for i in range(len(headers)):
        record[headers[i]] = words[i].strip()

      # Create an event with just the events from the fieldspec
      # Timestamp goes first.
      # Time should probably be normalized to epoch time.
      # Here, I'm just using whatever timestamp rw* gives us.

      eventTime = record[eventTimeSpec]
      eventValue = ""
      for fieldName in eventFieldSpec:
        eventValue += record[fieldName] + "|"
      event = [eventTime,eventValue]
      print "event", event
  
    linenum += 1

#+END_SRC   

#+RESULTS: eventExample
: event ['2013/03/20T08:42:11.957', '192.168.1.42|8.8.8.8|']
: event ['2013/03/20T08:55:46.607', '192.168.1.42|8.8.8.8|']
: event ['2013/03/20T08:55:46.633', '192.168.1.42|8.8.8.8|']
: event ['2013/03/20T08:55:46.673', '192.168.1.42|8.8.8.8|']

*** quiltPattern Example

#+name: quiltPatternExample
#+HEADER: :results output
#+HEADER: :exports both    
#+BEGIN_SRC python
import pprint
pp = pprint.PrettyPrinter(indent=4)

quiltPattern={}
quiltPattern["name"]="returnTrafficToScanSources"
quiltPattern["Expression"]="return silk.sip WHERE silk.sip talks to ${scanSources} AND silk.bytes > ${minBytes}"
quiltPattern["requiredParameters"]=["scanSources","minBytes"]
pp.pprint(quiltPattern)
#+END_SRC   

#+RESULTS: quiltPatternExample
: {   'Expression': 'return silk.sip WHERE silk.sip talks to ${scanSources} AND silk.bytes > ${minBytes}',
:     'name': 'returnTrafficToScanSources',
:     'requiredParameters': ['scanSources', 'minBytes']}

*** quiltPatternQueryID example

#+name: patternQueryIDExample
#+HEADER: :results output
#+HEADER: :exports both    
#+BEGIN_SRC python
import pprint
import time
pp = pprint.PrettyPrinter(indent=4)
import time

now="%f" % (time.time())
patternQueryID = {}
patternQueryID["name"]="returnTrafficToScanSources"
patternQueryID["time"]=now
patternQueryID["parameters"]="scanSources=scanners.set,minBytes=1000000"
pp.pprint(patternQueryID)
#+END_SRC   

#+RESULTS: patternQueryIDExample
: {   'name': 'returnTrafficToScanSources',
:     'parameters': 'scanSources=scanners.set,minBytes=1000000',
:     'time': '1364033133.112163'}

